{
	"FormatVersion": 2,
	"Namespace": "",
	"Subnamespaces": [
		{
			"Namespace": "Asset_Direct",
			"Children": [
				{
					"Source":
					{
						"Text": "This is a text literal asigned directly in TextBlock's Text property."
					},
					"Translation":
					{
						"Text": "Dies ist ein Textliteral, das direkt in der Eigenschaft Text des TextBlocks zugewiesen wird."
					},
					"Key": "text_literal_asset_1"
				}
			]
		},
		{
			"Namespace": "Cpp_Namespace_1",
			"Children": [
				{
					"Source":
					{
						"Text": "This is the first text literal created in code."
					},
					"Translation":
					{
						"Text": "Dies ist das erste im Code erstellte Textliteral."
					},
					"Key": "Cpp_TextLiteral_1"
				}
			]
		},
		{
			"Namespace": "Cpp_Namespace_2",
			"Children": [
				{
					"Source":
					{
						"Text": "This is the second text literal created in code."
					},
					"Translation":
					{
						"Text": "Dies ist das zweite im Code erstellte Textliteral."
					},
					"Key": "Cpp_TextLiteral_2"
				}
			]
		},
		{
			"Namespace": "ST_Animals",
			"Children": [
				{
					"Source":
					{
						"Text": "cat"
					},
					"Translation":
					{
						"Text": "Katze"
					},
					"Key": "st_cpp_animals_cat"
				},
				{
					"Source":
					{
						"Text": "dog"
					},
					"Translation":
					{
						"Text": "Hund"
					},
					"Key": "st_cpp_animals_dog"
				}
			]
		},
		{
			"Namespace": "ST_Fruits",
			"Children": [
				{
					"Source":
					{
						"Text": "apple"
					},
					"Translation":
					{
						"Text": "Apfel"
					},
					"Key": "st_aset_fruits_apple"
				},
				{
					"Source":
					{
						"Text": "banana"
					},
					"Translation":
					{
						"Text": "Banane"
					},
					"Key": "st_asset_fruits_banana"
				},
				{
					"Source":
					{
						"Text": "strawberry"
					},
					"Translation":
					{
						"Text": ""
					},
					"Key": "st_assets_fruits_strawberry"
				}
			]
		},
		{
			"Namespace": "ST_TextLocalization_Menu",
			"Children": [
				{
					"Source":
					{
						"Text": "Below you can find some examples of different ways of setting up a localizable text. Each example has additional information written in yellowish color explaining its setup."
					},
					"Translation":
					{
						"Text": "Nachstehend finden Sie einige Beispiele für verschiedene Möglichkeiten, einen lokalisierbaren Text einzurichten. Zu jedem Beispiel gibt es zusätzliche Informationen in gelblicher Farbe, die die Einrichtung erklären."
					},
					"Key": "introduction_info"
				},
				{
					"Source":
					{
						"Text": "Bonus - non-localized text examples:"
					},
					"Translation":
					{
						"Text": "Bonus - nicht lokalisierte Textbeispiele:"
					},
					"Key": "section_title_missing_localization"
				},
				{
					"Source":
					{
						"Text": "Creating text literals directly in an asset by using FText property."
					},
					"Translation":
					{
						"Text": "Erstellen von Textliteralen direkt in einem Asset mit der Eigenschaft FText."
					},
					"Key": "asset_localized_text"
				},
				{
					"Source":
					{
						"Text": "Creating text literals in C++ by using the LOCTEXT macros."
					},
					"Translation":
					{
						"Text": "Erstellen von Textliteralen in C++ unter Verwendung der LOCTEXT-Makros."
					},
					"Key": "cpp_loc_macro"
				},
				{
					"Source":
					{
						"Text": "Dynamically assigning a text from a String Table created in C++."
					},
					"Translation":
					{
						"Text": "Dynamische Zuweisung eines Textes aus einer in C++ erstellten Stringtabelle."
					},
					"Key": "cpp_string_table_dynamic_load"
				},
				{
					"Source":
					{
						"Text": "Linking texts from a String Table created as uasset."
					},
					"Translation":
					{
						"Text": "Verknüpfen von Texten aus einer als uasset erstellten String-Tabelle."
					},
					"Key": "asset_string_table"
				},
				{
					"Source":
					{
						"Text": "Linking texts from a String Table created in C++ from data loaded from a CSV file."
					},
					"Translation":
					{
						"Text": "Verknüpfung von Texten aus einer in C++ erstellten Stringtabelle mit Daten, die aus einer CSV-Datei geladen wurden."
					},
					"Key": "cpp_string_table_from_csv"
				},
				{
					"Source":
					{
						"Text": "Linking texts from a String Table created in C++ using LOCTABLE macros."
					},
					"Translation":
					{
						"Text": "Verknüpfung von Texten aus einer in C++ erstellten Stringtabelle mit Hilfe von LOCTABLE-Makros."
					},
					"Key": "cpp_string_table_from_loc_macro"
				},
				{
					"Source":
					{
						"Text": "Missing text localization - it always falls back to the native language."
					},
					"Translation":
					{
						"Text": "Fehlende Textlokalisierung - es wird immer auf die Muttersprache zurückgegriffen."
					},
					"Key": "missing_localization_text"
				},
				{
					"Source":
					{
						"Text": "Text Localization"
					},
					"Translation":
					{
						"Text": "Textlokalisierung"
					},
					"Key": "title_text_localization"
				},
				{
					"Source":
					{
						"Text": "Using String Tables:"
					},
					"Translation":
					{
						"Text": "String-Tabellen verwenden:"
					},
					"Key": "section_title_string_tables"
				},
				{
					"Source":
					{
						"Text": "Using Text Literals:"
					},
					"Translation":
					{
						"Text": "Verwendung von Textliteralen:"
					},
					"Key": "section_title_text_literals"
				},
				{
					"Source":
					{
						"Text": "Using non-localized text."
					},
					"Translation":
					{
						"Text": "Verwendung von nicht lokalisiertem Text."
					},
					"Key": "non_localized_text"
				}
			]
		},
		{
			"Namespace": "ST_Weapons",
			"Children": [
				{
					"Source":
					{
						"Text": "axe"
					},
					"Translation":
					{
						"Text": "Axt"
					},
					"Key": "st_cpp_weapons_axe"
				},
				{
					"Source":
					{
						"Text": "bow"
					},
					"Translation":
					{
						"Text": "Bogen"
					},
					"Key": "st_cpp_weapons_bow"
				},
				{
					"Source":
					{
						"Text": "sword"
					},
					"Translation":
					{
						"Text": "Schwert"
					},
					"Key": "st_cpp_weapons_sword"
				}
			]
		}
	]
}